webroot/mengniu/app/controllers/UserController.php

SELECT * FROM `tbl_participants`
---
    public function actionGetParticipants(){
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $participants = Participants::find()->asArray()->all();

SELECT * FROM `tbl_voting_record` WHERE `voter_openid`='2'
INSERT INTO `tbl_voting_record` (`participant_id`, `voter_openid`, `create_time`) VALUES (1, '2', 1526715868)
SELECT * FROM `tbl_participants` WHERE `id`='1'
UPDATE `tbl_participants` SET `vote_count`=1 WHERE `id`=1
---
    public function actionSaveVotingRecord(){

        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $post = Yii::$app->request->post();
        $participant_id = $post['participant_id'];
        $voter_openid = $post['voter_openid'];
        $hash = $post['hash'];

        if (time() >1527177600){   //   >5-25
            $result=['status' => false, 'code'=>403,'msg'=>'投票已结束!'];
            return $result;
        }else {
            if ($hash == md5($voter_openid . $_SERVER['SERVER_NAME'])) {
                $voter = VotingRecord::find()->where(['voter_openid' => $voter_openid])->one();
                if ($voter) {//该投票者已存在 不能再投票
                    $result = array('status' => false, 'code' => 400, 'msg' => '您已经投过票,不能再投票！');
                    return $result;
                } else {//新的投票者
                    $voteRecord = new VotingRecord();
                    $voteRecord->participant_id = $participant_id;//参赛者id
                    $voteRecord->voter_openid = $voter_openid;//投票人openid
                    $voteRecord->create_time = time();
                    $voteRecord->save();

                    if ($voteRecord) { //保存记录成功时
                        $participants = Participants::find()->where(['id' => $participant_id])->one();
                        $participants->vote_count += 1;
                        $participants->save();

DELETE FROM `tbl_voting_record`
UPDATE `tbl_participants` SET `vote_count`=0
---
    public function actionDeleteAllAnne()
    {
        $votingRecord = VotingRecord::deleteAll();
        Yii::$app->db->createCommand()->update('tbl_participants', ['vote_count' => 0])->execute();